//
//  ArrayTestFile.swift
//  tictactoc
//
//  Created by kimdaeman14 on 2018. 7. 21..
//  Copyright © 2018년 GoldenShoe. All rights reserved.
//

import Foundation
import UIKit


/*********************************************************
 할일
 
 각버튼마다의 인덱스를 갖고와서.
 버튼 누를떄마다 와일문을 돌려서 (전부다 탐색해야함)
 내공식에있는
 가로성공기준 : (0+1)2 = 2
 좌측아래대각선 성공기준 : (0+4)2 = 8
 세로성공기준 : (0+3)2 = 6
 단,, 3칸밖에없을때를 가정함.
 
 
 그걸도전해봐야함. 자고일어나서. 일단자자..아니일하자.
 
 *********************************************************/


class TestViewController: UIViewController {


    override func viewDidLoad() {
        super.viewDidLoad()
        
        
        /*********************************************************
         실험시작.
         버튼하나를 놓을때마다 와일문으로 배열을 다 돌아서 해당 되는 조건에 맞는 것이
         있다면 얼럿창을 띄운다.
         
         arr1[2] + arr1[3] + arr1[4] = 3 or == ? alert!
         arr1[2] + arr2[2] + arr3[2] = 3 or == ? alert!
         arr1[2] + arr2[3] + arr3[4] = 3 or == ? alert!
         
         0 0 1 1 1 0 0 0
         0 0 1 1 0 0 0 0
         0 0 1 0 1 0 0 0
         *********************************************************/
       
        
        
    }
}
